## staging: eks
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 4 to add, 0 to change, 3 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                        NAME                         |
|----------|-----------------------------------------------------|
| recreate | `aws_iam_role_policy_attachment.parameters_csi_api` |
|          | `aws_iam_role_policy_attachment.secrets_csi_api`    |
| add      | `aws_iam_role.api`                                  |
|          | `aws_iam_role_policy_attachment.api_worker`         |
| delete   | `aws_iam_role.secrets_csi_api`                      |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_iam_role.api will be created
  + resource "aws_iam_role" "api" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C:aud" = "sts.amazonaws.com"
                              + "oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C:sub" = "system:serviceaccount:notification-canada-ca:notify-api"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::239043911459:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "api-eks-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.secrets_csi_api will be destroyed
  # (because aws_iam_role.secrets_csi_api is not in configuration)
  - resource "aws_iam_role" "secrets_csi_api" {
      - arn                   = "arn:aws:iam::239043911459:role/secrets-csi-role-api" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - "oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C:aud" = "sts.amazonaws.com"
                              - "oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C:sub" = "system:serviceaccount:notification-canada-ca:notify-api"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::239043911459:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2024-10-30T15:40:47Z" -> null
      - force_detach_policies = false -> null
      - id                    = "secrets-csi-role-api" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::239043911459:policy/parameters-csi-policy",
          - "arn:aws:iam::239043911459:policy/secrets-csi-policy",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "secrets-csi-role-api" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROATPKBAT4RWQNWR3WQX" -> null
        # (3 unchanged attributes hidden)
    }

  # aws_iam_role_policy_attachment.api_worker will be created
  + resource "aws_iam_role_policy_attachment" "api_worker" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::239043911459:policy/notification-worker-policy"
      + role       = "api-eks-role"
    }

  # aws_iam_role_policy_attachment.parameters_csi_api must be replaced
-/+ resource "aws_iam_role_policy_attachment" "parameters_csi_api" {
      ~ id         = "secrets-csi-role-api-20241030154048036600000001" -> (known after apply)
      ~ role       = "secrets-csi-role-api" -> "api-eks-role" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_iam_role_policy_attachment.secrets_csi_api must be replaced
-/+ resource "aws_iam_role_policy_attachment" "secrets_csi_api" {
      ~ id         = "secrets-csi-role-api-20241030154048177000000002" -> (known after apply)
      ~ role       = "secrets-csi-role-api" -> "api-eks-role" # forces replacement
        # (1 unchanged attribute hidden)
    }

Plan: 4 to add, 0 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.client_vpn"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca-alt[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_acmpca_certificate_authority.client_vpn"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.internal_alb_tls"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.internal_nginx_http"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-admin"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-documentation"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-application-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-cluster-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-prometheus-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-evicted-pods[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-cpu-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-memory-warning[0]"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
